

( function( window, document, undefined ){

// this flag means whether pages call dummy APIs or Workable APIs.
window.dummy = true;

window.commonValues = {
    "CS0001" : {
        "M" : "가입",
        "C" : "쿠폰생성",
        "S" : "통계",
        "E" : "기타"
    },
    "CS0002" : {
        "1" : "공통",
        "2" : "점주",
        "3" : "대행사",
        "4" : "제조사",
        "5" : "제휴사"
    },
    "CS0003" : {
        "A" : "전체",
        "S" : "SMS/MMS",
        "E" : "Email"
    },
    "CS0004" : {
        "D" : "Daily",
        "W" : "Weekly"
    },
    "CS0005" : {
        "1" : "일요일",
        "2" : "월요일",
        "3" : "화요일",
        "4" : "수요일",
        "5" : "목요일",
        "6" : "금요일",
        "7" : "토요일"
    },
    "CS0006" : {
        "AM" : "오전",
        "PM" : "오후"
    },
    "CS0007" : {
        "01" : "회원 가입 승인 완료",
        "02" : "Benefit(쿠폰) 승인 완료",
        "03" : "Benefit(쿠폰) 진행 완료",
        "04" : "Benefit(쿠폰) 반려"
    },
    "CS0008" : {
        "M" : "가입",
        "C" : "쿠폰생성",
        "S" : "통계",
        "E" : "기타"
    },
    "CS0009" : {
        "N" : "공지사항용 첨부",
        "Q" : "공지사항용 첨부",
        "A" : "공지사항용 첨부",
        "F" : "공지사항용 첨부"
    },
    "CS0010" : {
        "01" : "일반알림",
        "02" : "페이지링크존재하는 알림"
    },
    "CS0011" : {
        "01" : "IS생성 OCB 무료쿠폰",
        "02" : "IS생성 S/W 무료쿠폰",
        "03" : "불러오기 OCB 무료쿠폰",
        "04" : "불러오기 OCB 유료쿠폰",
        "05" : "불러오기 S/W 무료쿠폰",
        "06" : "불러오기 기프티콘",
        "07" : "모바일전단지",
        "08" : "단골샵전단지"
    },
    "CS0012" : {
        "1" : "이용약관",
        "2" : "통신과금서비스이용약관",
        "3" : "개인정보취급방침",
        "4" : "정보/광고활용"
    },
    "ST0001" : {
        "R01" : "1KM",
        "R02" : "2KM",
        "R03" : "3KM",
        "R04" : "5KM"
    },
    "ST0002" : {
        "1" : "1주차",
        "2" : "2주차",
        "3" : "3주차",
        "4" : "4주차",
        "5" : "5주차"
    },
    "ST0003" : {
        "1" : "00~09세",
        "2" : "10~19세",
        "3" : "20~29세",
        "4" : "30~39세",
        "5" : "40~49세",
        "6" : "50~59세",
        "7" : "60세이상",
        "ZZ" : "분류외"
    },
    "ST0004" : {
        "11" : "서울",
        "26" : "부산",
        "27" : "대구",
        "28" : "인천",
        "29" : "광주",
        "30" : "대전",
        "31" : "울산",
        "36" : "세종",
        "41" : "경기",
        "42" : "강원",
        "43" : "충북",
        "44" : "충남",
        "45" : "전북",
        "46" : "전남",
        "47" : "경북",
        "48" : "경남",
        "50" : "제주",
        "X"  : "미상",
        "Y" : "미입력",
        "Z" : "미등록"
    },
    "ST0005" : {
        "1" : "남성",
        "2" : "여성",
        "3" : "기타",
        "4" : "남여",
        "X" : "미상",
        "Y" : "미입"
    },
    "ST0006" : {
        "L" : "시/도 기준",
        "S" : "주소 기준"
    },
    "ST0007" : {
        "1" : "월요일",
        "2" : "화요일",
        "3" : "수요일",
        "4" : "목요일",
        "5" : "금요일",
        "6" : "토요일",
        "7" : "일요일"
    },
    "ST0008" : {
       "0" : "0세",
       "1" : "1~9세",
       "2" : "10대",
       "3" : "20대",
       "4" : "30대",
       "5" : "40대",
       "6" : "50대",
       "7" : "60대",
       "8" : "70대",
       "9" : "80대",
       "10" : "90대",
       "90" : "100세 이상",
       "99" : "미상"
    }
};

}( window, document ));